:PROPERTIES:
:ID: 0da49716-852d-4814-aa83-13452db3fae4
:END:
#+title: List Feature Flags
#+description: List Feature Flags
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:variability:
#+created: 2026-05-21
#+updated: 2026-05-21

    :PROPERTIES:
    :header-args+: :var login_args="--login-username newuser3"
    :END:

#+name: list-feature-flags
#+begin_src ores-shell :exports none
variability list-flags
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args}  << 'EOF'
<<list-feature-flags>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
  Tenant: System (00000000-0000-0000-0000-000000000000)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell>
+--------------------------------------+---------+---------------------------------------------------------------------------------------------------------------------+---------+-------------------+-------------+-------------------------------+
| Name                                 | Version | Description                                                                                                         | Enabled | Change Reason     | Recorded By | Recorded At                   |
+--------------------------------------+---------+---------------------------------------------------------------------------------------------------------------------+---------+-------------------+-------------+-------------------------------+
| system.bootstrap_mode                | 1       | Indicates whether the system is in bootstrap mode (waiting for initial admin account).                              | 0       | system.new_record | system      | 2026-02-05 11:31:42.000000000 |
| system.synthetic_data_generation     | 1       | Enables synthetic test data generation in the UI. FOR TESTING/DEVELOPMENT ONLY.                                     | 0       | system.new_record | postgres    | 2026-02-05 11:29:49.000000000 |
| system.disable_password_validation   | 1       | When enabled, disables strict password validation. FOR TESTING/DEVELOPMENT ONLY.                                    | 0       | system.new_record | postgres    | 2026-02-05 11:29:49.000000000 |
| system.signup_requires_authorization | 1       | Controls whether new signups require admin authorization. NOT YET IMPLEMENTED - enabling will cause signup to fail. | 0       | system.new_record | postgres    | 2026-02-05 11:29:49.000000000 |
| system.user_signups                  | 1       | Controls whether user self-registration is allowed.                                                                 | 0       | system.new_record | postgres    | 2026-02-05 11:29:49.000000000 |
+--------------------------------------+---------+---------------------------------------------------------------------------------------------------------------------+---------+-------------------+-------------+-------------------------------+


ores-shell> Bye!
#+end_example
